{
"title": "How to Stop Your CEO from Getting Email Spoofed",
"section": "microsoft365",
"description": "Microsoft 365's mailbox intelligence is the easiest way to stop your organization from getting spoofed.",
"canonical": "stop-spoofing",
"imgPath": "/microsoft365/mailbox-intelli.png",
"published": "2025-01-17T01:46:15.537Z",
"articleHtml": "<p>Email spoofing is a tactic attackers use to make an email look like it’s coming from a trusted employee — especially executives like your CEO — even when it’s from a bad actor. When attackers spoof your CEO’s email, they can trick employees, vendors, or partners into transferring money, revealing passwords, or clicking malicious links. This guide walks through key defenses you should implement.</p><h2>1. Use Proven Email Authentication Standards</h2><p>Implement the foundational email authentication standards to ensure that receiving mail servers can verify legitimate messages from your domain:</p><ul><li><strong>SPF</strong> (Sender Policy Framework) — Defines which mail servers are allowed to send mail for your domain. :contentReference[oaicite:1]{index=1}</li><li><strong>DKIM</strong> (DomainKeys Identified Mail) — Adds a digital signature to your outgoing emails so recipients can verify they weren’t tampered with. :contentReference[oaicite:2]{index=2}</li><li><strong>DMARC</strong> (Domain-based Message Authentication, Reporting & Conformance) — Tells receiving servers what to do when SPF or DKIM checks fail. :contentReference[oaicite:3]{index=3}</li></ul><h2>2. Enable Anti-Phishing & Intelligent Detection</h2><p>Email providers like Microsoft Defender for Office 365 have advanced settings designed to detect when an email might be pretending to be a trusted sender — even if it technically appears valid. These include:</p><ul><li>Behavior-based machine learning that learns normal communication patterns. :contentReference[oaicite:4]{index=4}</li><li>Impersonation protection that flags emails mimicking users or domains. :contentReference[oaicite:5]{index=5}</li><li>Spoof intelligence to block messages that aren’t sent from your official mail platform. :contentReference[oaicite:6]{index=6}</li></ul><p>See how to enable and configure these protections in your Microsoft 365 tenant in the official guide: <a href=\"https://www.gitbit.org/docs/enable-mailbox-intelligence-ue968h7q\" class=\"link\" target=\"_blank\">Enable Intelligence for Impersonation Protection</a>. :contentReference[oaicite:7]{index=7}</p><h2>3. Protect High-Value Targets</h2><p>Your CEO, CFO, and other executives are prime targets for spoofing attacks. Make sure they are included in your anti-phishing and impersonation protection settings. Some email security solutions let you explicitly mark VIPs, triggering tighter rules for messages that appear to be from them. :contentReference[oaicite:8]{index=8}</p><h2>4. Configure Policy Actions</h2><p>Instead of just detecting spoofed or impersonated messages, configure your policies to take action — such as quarantining suspicious messages or flagging them for administrator review. Regular monitoring of these policies will help keep them effective over time. :contentReference[oaicite:9]{index=9}</p><h2>5. Train Your Team</h2><p>Even with strong technical controls, your employees are the last line of defense:</p><ul><li>Train staff to recognize spoofed emails and suspicious requests. :contentReference[oaicite:10]{index=10}</li><li>Use phishing simulation campaigns to reinforce training. :contentReference[oaicite:11]{index=11}</li><li>Require verbal or secondary authentication for financial or sensitive requests. :contentReference[oaicite:12]{index=12}</li></ul><h2>6. Implement Verification Procedures</h2><p>For high-risk actions like wire transfers or vendor payments, don’t rely solely on email — implement multi-step verification such as verbal confirmation or secure messaging apps. :contentReference[oaicite:13]{index=13}</p>"
}